using System;

namespace HelloConsole
{
    class Program
    {
        static void Main()
        {
            Console.Write("машина едет, ");

            /* тут
             * пиши
             * че
             * хочешь */

            Console.WriteLine("поехала далее"); // тут готовится спускаться вниз
            Console.WriteLine("уже на этаж ниже"); // тут уже внизу, тк прошлая была втиреЛИНЕ))) 
            Console.ReadKey();  // тут только одна буква, братик
            Console.WriteLine("\tпроверка");  //это таб (табуляция)
            Console.ReadLine(); // тут целая строка, вводи че хочешь, потом жми ентер
            Console.Write("XXXXXKKKX\n");     //из-за ескейп символа строка перешла вниз, в самом предложении нажался ентер типа, но лучше использовать WriteLine)
            Console.ReadKey(true); //любая клавиша, просто что бы продолжить программу
            Console.WriteLine("ЧЕ?)))");
            Console.WriteLine();  //просто отступ

            /* ЕСКЕЙП СИМВОЛЫ
             * это некие команды внутри предложенй "", они нужны для более удобного взаимодействия с текстом и объяснения их программе
             * без них нашему компу будет тяжело понять, что я от него хочу, или где заканчивается та или иная команда
             * пример на практике ниже */

            Console.WriteLine("я прочел книгу \"как дышать\""); //  \ перед символом означает, что следующий символ не служебный, а обычный
            Console.WriteLine();
            Console.WriteLine("-сын, иди кушать\n-мама, я не голоден"); //а этот уже спускает строку ниже, мол нажимается ентер при написании предложения
            Console.WriteLine("");
            Console.WriteLine("А\tB\tC\tD"); // символ t ставит табуляцию(можно делать таблички, позже покажу)
            Console.WriteLine();
            Console.WriteLine("c:\\система\\папка\\еще папка"); // а тут знак \ говорит программе, что второй \ это часть текста, а не команды
            Console.WriteLine();

            // вот и табуляция, как я понимаю, она очень хороша для создания таблиц
            Console.Write("МОЛОКО\t20рублей\nХЛЕБ\t12рублей\nЯЙЦА\t16рублей");  //тут наглядно показал, для чего нужна табуляция + совместил два ескейп символа для наглядности их работы
            Console.WriteLine();
        }
    }
}